app/Controllers/AdminDashboardController.php

    public function users()

    {
        $model= new ModelsUserModel();
        $users = $model->findall();
---
SELECT *
FROM `users`