app/Controllers/Home.php

INSERT INTO `users` (`username`, `email`, `password`) VALUES ('meziane_maamar@yahoo.fr', 'meziane_maamar@yahoo.fr', '$2y$10$B70kJ5CnKw7d5cOVbbCMS.eRj2L/JSZ5ItjjFpSlQ7836ZGVDWAky')
---
    public function register()
    {
        $validation = \Config\Services::validation();

        if ($this->request->getMethod() === 'get') {
            echo view('register', ['validation' => $validation]);
        } else if ($this->request->getMethod() === 'post') {
            if ($this->validate([
                "username" => "required",
                "email" => "required|valid_email",
                "password" => "required|min_length[5]|max_length[20]",
                "cpassword" => "matches[password]",
            ])) {
               // envoyé le formulaire
                $username = $this->request->getVar("username");
                $email = $this->request->getVar("email");
                $password = $this->request->getVar("password");

               // maintenant enregistrez les données ds la BD

               $data=[
                    "username"=>$username,
                    "email"=>$email,
                    "password"=>$password,

               ];

               $model= new ModelsUserModel();
               $model->insert($data);

SELECT *
FROM `users`
WHERE `email` = 'mezianeg@yahoo.fr'
 LIMIT 1
---
    public function login()
    {
        $session = session();

        if ($this->request->getMethod() == "get") {
            echo view('login');
        } elseif ($this->request->getMethod() == "post") {
            $validation = \Config\Services::validation();

            // Validation
            if ($validation->run($this->request->getPost(), 'login')) {
                // Les règles de validation ont été respectées
                // Effectuez ici les actions nécessaires pour l'authentification de l'utilisateur

                $email = $this->request->getVar("email");
                $password = $this->request->getVar("password");

                $model = new ModelsUserModel();
                $record = $model->where('email', $email)->first();

SELECT *
FROM `user_details`
WHERE `user_id` = '24'
 LIMIT 1
---
                public function profile(){

                    if ($this->request->getMethod()=="get") {
                        echo view("profile");
                    }
                    else if($this->request->getMethod()=="post"){

                        $country=$this->request->getvar('country');
                        $state=$this->request->getvar('state');
                        $district=$this->request->getvar('district');
                        $pincode=$this->request->getvar('pincode');
                        $mobile=$this->request->getvar('mobile');
                        $local_address=$this->request->getvar('local_address');
                        $permanent_address=$this->request->getvar('permanent_address');

                        $model = new UserDetailsModel();
                        $session=session();
                        $user_id=$session->user_id;
                        $record=$model->where("user_id", $user_id)->first();